src/DataProcessors/d3_v4/d3_v4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>d3_v4</name>
</mdclass:DataProcessor>

src/InformationRegisters/ПоложениеТехникиСкаут/ПоложениеТехникиСкаут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоложениеТехникиСкаут</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТипаТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Азимут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоординатаX</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоординатаY</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипТехники</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СКонтейнером</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/d3_v4/Forms/ИнформацияТехника/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Наименование = Параметры.Наименование;
	ТипТехники = Параметры.ТипТехники;
	ЗаполнитьНаименованиеИзУКТ();
	Заголовок = СтрШаблон("Информация о технике: %1", Наименование);
	Если ТехникаМожетНестиКонтейнер(ТипТехники) Тогда
		ЗаполнитьКонтейнерНаТехнике();
	Иначе
		Элементы.Контейнер.Видимость = Ложь;
	КонецЕсли;
	ЗаполнитьСостояниеИзСкаут();
	ЗаполнитьВодителяИзРегистра();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)

	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаименованиеИзУКТ()

	Если Не Константы.ПолучениеРеальныхДанных.Получить() Или Параметры.ИдентификаторСкаут = 0 Тогда
		Возврат;
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Попытка
		ИмяУКТ = ОбработкаОбъект.ПолучитьНаименованиеТехникиИзУКТ(Параметры.ИдентификаторСкаут);
		Если ЗначениеЗаполнено(ИмяУКТ) Тогда
			Наименование = ИмяУКТ;
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтейнерНаТехнике()

	Если Не Константы.ПолучениеРеальныхДанных.Получить() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Реальные данные отключены. Сведения о контейнере не загружены.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	ДанныеКонтейнера = Неопределено;
	Если Параметры.ИдентификаторСкаут <> 0 Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Попытка
			ДанныеКонтейнера = ОбработкаОбъект.ПолучитьКонтейнерНаТехникеИзУКТ(Параметры.ИдентификаторСкаут);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось получить контейнер на технике из УКТ: " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;

	Если ДанныеКонтейнера <> Неопределено Тогда
		Контейнер = ДанныеКонтейнера.НомерКонтейнера;
		Откуда = ДанныеКонтейнера.АдресОткуда;
		Куда = ДанныеКонтейнера.АдресКуда;
		Операция = ДанныеКонтейнера.Операция;
		Если ДанныеКонтейнера.ДатаОперации <> Null И ДанныеКонтейнера.ДатаОперации <> Неопределено Тогда
			Дата = ДанныеКонтейнера.ДатаОперации;
		КонецЕсли;
	КонецЕсли;

	// Если Откуда не заполнено из УКТ (или запрос ничего не вернул), пробуем разобрать строку из регистра Скаут
	СтрокаИнфо = "";
	// @skip-check optional-form-parameter-access
	Если ПустаяСтрока(Откуда) И Параметры.Свойство("Информация", СтрокаИнфо) И ЗначениеЗаполнено(СтрокаИнфо) Тогда
		РазобратьСтрокуИнформации(СтрокаИнфо);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РазобратьСтрокуИнформации(СтрокаИнфо)

	// Формат в регистре Скаут: "%1: %2->%3 %4" (Контейнер: Откуда->Куда Время)
	Текст = СокрЛП(Строка(СтрокаИнфо));
	ПозицияТчкЗпт = СтрНайти(Текст, ";", НаправлениеПоиска.СКонца);
	Если ПозицияТчкЗпт > 0 Тогда
		Текст = СокрЛП(Сред(Текст, ПозицияТчкЗпт + 1));
	КонецЕсли;

	ПозицияДвоеточия = СтрНайти(Текст, ":");
	Если ПозицияДвоеточия = 0 Тогда
		Возврат;
	КонецЕсли;

	НомерКт = СокрЛП(Лев(Текст, ПозицияДвоеточия - 1));
	Остаток = СокрЛП(Сред(Текст, ПозицияДвоеточия + 1));

	ПозицияСтрелки = СтрНайти(Остаток, "->");
	Если ПозицияСтрелки = 0 Тогда
		Возврат;
	КонецЕсли;

	АдрОткуда = СокрЛП(Лев(Остаток, ПозицияСтрелки - 1));
	Хвост = СокрЛП(Сред(Остаток, ПозицияСтрелки + 2));

	ПозицияПробела = СтрНайти(Хвост, " ", НаправлениеПоиска.СКонца);
	АдрКуда = Хвост;
	Если ПозицияПробела > 0 Тогда
		КандидатВремя = СокрЛП(Сред(Хвост, ПозицияПробела + 1));
		Если СтрДлина(КандидатВремя) = 8 И СтрНайти(КандидатВремя, ":") = 3 Тогда
			АдрКуда = СокрЛП(Лев(Хвост, ПозицияПробела - 1));
		КонецЕсли;
	КонецЕсли;

	Если ПустаяСтрока(Контейнер) И Не ПустаяСтрока(НомерКт) Тогда
		Контейнер = НомерКт;
	КонецЕсли;
	Если ПустаяСтрока(Откуда) И Не ПустаяСтрока(АдрОткуда) Тогда
		Откуда = АдрОткуда;
	КонецЕсли;
	Если ПустаяСтрока(Куда) И Не ПустаяСтрока(АдрКуда) Тогда
		Куда = АдрКуда;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостояниеИзСкаут()

	Скорость = "Нет данных";
	Двигатель = "Нет данных";
	ОстатокТоплива = "Нет данных";
	ДатаОнлайнДанных = "Нет данных";

	Если Не Константы.ПолучениеРеальныхДанных.Получить() Или Параметры.ИдентификаторСкаут = 0 Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ОбработкаСкаут = Обработки.Скаут.Создать();
		Состояние = ОбработкаСкаут.ПолучитьСостояниеТехники(Параметры.ИдентификаторСкаут);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить состояние техники из Скаут: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;

	Если Состояние.Скорость <> Неопределено Тогда
		Скорость = СтрШаблон("%1 км/ч", Формат(Состояние.Скорость, "ЧДЦ=0; ЧН=0; ЧГ=0"));
	КонецЕсли;
	Если Состояние.ДвигательРаботает <> Неопределено Тогда
		Если Состояние.ДвигательРаботает Тогда
			Двигатель = "Запущен";
			Элементы.Двигатель.ЦветТекста = WebЦвета.Зеленый;
		Иначе
			Двигатель = "Остановлен";
			Элементы.Двигатель.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЕсли;
	Если Состояние.ОстатокТоплива <> Неопределено Тогда
		ОстатокТоплива = СтрШаблон("%1 л", Формат(Состояние.ОстатокТоплива, "ЧДЦ=0; ЧН=0; ЧГ=0"));
	КонецЕсли;
	Если Состояние.ДатаДанных <> Неопределено Тогда
		ДатаОнлайнДанных = Формат(Состояние.ДатаДанных, "ДФ='dd.MM.yyyy HH:mm:ss'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВодителяИзРегистра()

	Если Параметры.ИдентификаторСкаут = 0 Тогда
		Водитель = "Нет данных";
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Положение.Водитель КАК Водитель
	|ИЗ
	|	РегистрСведений.ПоложениеТехникиСкаут.СрезПоследних(, Идентификатор = &Идентификатор) КАК Положение";
	Запрос.УстановитьПараметр("Идентификатор", Параметры.ИдентификаторСкаут);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Водитель = "Нет данных";
		Возврат;
	КонецЕсли;

	Водитель = СокрЛП(Строка(Выборка.Водитель));

КонецПроцедуры

&НаСервере
Функция ТехникаМожетНестиКонтейнер(ТипТехникиФормы)

	Возврат ТипТехникиФормы <> "Буксиры"
		И ТипТехникиФормы <> "Экскаваторы"
		И ТипТехникиФормы <> "Бульдозеры";

КонецФункции

#КонецОбласти
